Revit 2026 API

# RebarConstraintGetTargetRebarBendNumber Method

---

Returns the number of the bend on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'BarBend'. Rebar must be Shape Driven Rebar element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetTargetRebarBendNumber()
```
```vb
Public Function GetTargetRebarBendNumber As Integer
```
```cpp
public:
int GetTargetRebarBendNumber()
```
```fsharp
member GetTargetRebarBendNumber : unit -> int
```

#### Return Value

Int32

| Exception | Condition |
| --- | --- |
| InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- The RebarTargetConstraintType is not 'BarBend' -or- Constrained rebar isn't a shape driven rebar element. |

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace